LEXICON_RU: dict[str, str] = {'del': '❌',
                              'edit_button': '❌ РЕДАКТИРОВАТЬ',
                              'edit_video_list': '<b>Редактировать список видео</b>',
                              'cancel_button': 'ВЫЙТИ',
                              'cancel_redact_text': 'Вы вышли из списка видео',
                              'cancel_video_add': 'Вы прекратили добавление видео\n\n'
                                                  'Чтобы снова перейти к добавлению видео - '
                                                  'отправьте команду /add_video',
                              'nothing_cancel': 'Нечего отменять',
                              'echo_message': ', я вас не понимаю 🙊\r\n'
                                              'Если нужна помощь нажмите /help',
                              '/help': 'Я бот, который может предоставить информацию о кол-ве лайков, просмотров и '
                                       'дате публикации видео с сайта YouTube\r\n\n'
                                       'Доступные команды:\n\n'
                                       '/add_video - добавить видео\r\n'
                                       '/list_video - посмотреть список добавленных ссылок на видео\r\n'
                                       '/help - справка по работе бота\r\n'
                                       '/cancel - отмена добавления ссылки на видео в список',
                              '/start': '<b>привет!</b>\r\n\n'
                                        'Ты успешно авторизован(-a)\r\n\n'
                                        'Чтобы посмотреть список доступных команд - набери /help',
                              '/add_video': '<b>введите ссылку</b>\r\n\n'
                                            'Ссылка на видео будет сохранена\r\n'
                                            'Сохраненные ссылки можно посмотреть по команде /list_video',
                              '/list_video': '<b>Список добавленных видео: </b>',
                              'no_video_in_list': 'Список видео пуст\r\n\n'
                                                  'Что бы добавить видео воспользуйтесь командой /add_video',

                              'name_for_video': 'Отлично, ссылку запомнил!\r\n\n'
                                            'Теперь придумайте и введите название для видео или просто нажмите /skip',
                              'no_url': 'Отсутствует ссылка на видео\r\n'
                                        'Что бы получить информацию о видео, наберите команду /add_video',
                              'loading_info': 'Загружаю информацию о видео, подождите...',
                              'not_correct_url': 'Не корректная ссылка на видео 🙈\r\n\n'
                                                 'Можно добавить видео только с YouTube!\r\n\n'
                                                 'Если хотите прекратить ввод отправьте команду /cancel',
                              'not_authorized': 'Извините, No Name, вы не авторизованы.\r\n'
                                                'Для авторизации наберите команду /start',

                              }
